Tekla Open API Reference for Tekla Structures 2025
GeometricPlane Constructor (CoordinateSystem)
 Instantiates a plane defined by the given coordinate system.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeometricPlane(
	CoordinateSystem CoordSys
)
Public Sub New (
	CoordSys As CoordinateSystem
)
Parameters
CoordSys
Type: Tekla.Structures.Geometry3d.CoordinateSystem
The coordinate system to be used.
See Also
Reference
GeometricPlane Class
GeometricPlane Overload
Tekla.Structures.Geometry3d Namespace